Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ16MC102.h
#define _P1SECMP_SEVTDIR_POSITION                0x0000000F
#define _P1SECMP_SEVTDIR_MASK                    0x00008000
#define _P1SECMP_SEVTDIR_LENGTH                  0x00000001

#define _SEVTCMP_SEVTCMP_POSITION                0x00000000
#define _SEVTCMP_SEVTCMP_MASK                    0x00007FFF
#define _SEVTCMP_SEVTCMP_LENGTH                  0x0000000F

#define _SEVTCMP_SEVTDIR_POSITION                0x0000000F
#define _SEVTCMP_SEVTDIR_MASK                    0x00008000
#define _SEVTCMP_SEVTDIR_LENGTH                  0x00000001

#define _PWM1CON1_PEN1L_POSITION                 0x00000000
#define _PWM1CON1_PEN1L_MASK                     0x00000001
#define _PWM1CON1_PEN1L_LENGTH                   0x00000001

#define _PWM1CON1_PEN2L_POSITION                 0x00000001
#define _PWM1CON1_PEN2L_MASK                     0x00000002
#define _PWM1CON1_PEN2L_LENGTH                   0x00000001

#define _PWM1CON1_PEN3L_POSITION                 0x00000002
#define _PWM1CON1_PEN3L_MASK                     0x00000004
#define _PWM1CON1_PEN3L_LENGTH                   0x00000001

#define _PWM1CON1_PEN1H_POSITION                 0x00000004
#define _PWM1CON1_PEN1H_MASK                     0x00000010
#define _PWM1CON1_PEN1H_LENGTH                   0x00000001

#define _PWM1CON1_PEN2H_POSITION                 0x00000005
#define _PWM1CON1_PEN2H_MASK                     0x00000020
#define _PWM1CON1_PEN2H_LENGTH                   0x00000001

#define _PWM1CON1_PEN3H_POSITION                 0x00000006
#define _PWM1CON1_PEN3H_MASK                     0x00000040
#define _PWM1CON1_PEN3H_LENGTH                   0x00000001

#define _PWM1CON1_PMOD1_POSITION                 0x00000008
#define _PWM1CON1_PMOD1_MASK                     0x00000100
#define _PWM1CON1_PMOD1_LENGTH                   0x00000001

#define _PWM1CON1_PMOD2_POSITION                 0x00000009
#define _PWM1CON1_PMOD2_MASK                     0x00000200
#define _PWM1CON1_PMOD2_LENGTH                   0x00000001

#define _PWM1CON1_PMOD3_POSITION                 0x0000000A
#define _PWM1CON1_PMOD3_MASK                     0x00000400
#define _PWM1CON1_PMOD3_LENGTH                   0x00000001

#define _PWMCON1_PEN1L_POSITION                  0x00000000
#define _PWMCON1_PEN1L_MASK                      0x00000001
#define _PWMCON1_PEN1L_LENGTH                    0x00000001

#define _PWMCON1_PEN2L_POSITION                  0x00000001
#define _PWMCON1_PEN2L_MASK                      0x00000002
#define _PWMCON1_PEN2L_LENGTH                    0x00000001

#define _PWMCON1_PEN3L_POSITION                  0x00000002
#define _PWMCON1_PEN3L_MASK                      0x00000004
#define _PWMCON1_PEN3L_LENGTH                    0x00000001

#define _PWMCON1_PEN1H_POSITION                  0x00000004
#define _PWMCON1_PEN1H_MASK                      0x00000010
#define _PWMCON1_PEN1H_LENGTH                    0x00000001

#define _PWMCON1_PEN2H_POSITION                  0x00000005
#define _PWMCON1_PEN2H_MASK                      0x00000020
#define _PWMCON1_PEN2H_LENGTH                    0x00000001

#define _PWMCON1_PEN3H_POSITION                  0x00000006
#define _PWMCON1_PEN3H_MASK                      0x00000040
#define _PWMCON1_PEN3H_LENGTH                    0x00000001

#define _PWMCON1_PMOD1_POSITION                  0x00000008
#define _PWMCON1_PMOD1_MASK                      0x00000100
#define _PWMCON1_PMOD1_LENGTH                    0x00000001

#define _PWMCON1_PMOD2_POSITION                  0x00000009
#define _PWMCON1_PMOD2_MASK                      0x00000200
#define _PWMCON1_PMOD2_LENGTH                    0x00000001

#define _PWMCON1_PMOD3_POSITION                  0x0000000A
#define _PWMCON1_PMOD3_MASK                      0x00000400
#define _PWMCON1_PMOD3_LENGTH                    0x00000001

#define _PWM1CON2_UDIS_POSITION                  0x00000000
#define _PWM1CON2_UDIS_MASK                      0x00000001
#define _PWM1CON2_UDIS_LENGTH                    0x00000001

#define _PWM1CON2_OSYNC_POSITION                 0x00000001
#define _PWM1CON2_OSYNC_MASK                     0x00000002
#define _PWM1CON2_OSYNC_LENGTH                   0x00000001

#define _PWM1CON2_IUE_POSITION                   0x00000002
#define _PWM1CON2_IUE_MASK                       0x00000004
#define _PWM1CON2_IUE_LENGTH                     0x00000001

#define _PWM1CON2_SEVOPS_POSITION                0x00000008
#define _PWM1CON2_SEVOPS_MASK                    0x00000F00
#define _PWM1CON2_SEVOPS_LENGTH                  0x00000004

#define _PWM1CON2_SEVOPS0_POSITION               0x00000008
#define _PWM1CON2_SEVOPS0_MASK                   0x00000100
#define _PWM1CON2_SEVOPS0_LENGTH                 0x00000001

#define _PWM1CON2_SEVOPS1_POSITION               0x00000009
#define _PWM1CON2_SEVOPS1_MASK                   0x00000200
#define _PWM1CON2_SEVOPS1_LENGTH                 0x00000001

#define _PWM1CON2_SEVOPS2_POSITION               0x0000000A
#define _PWM1CON2_SEVOPS2_MASK                   0x00000400
#define _PWM1CON2_SEVOPS2_LENGTH                 0x00000001

#define _PWM1CON2_SEVOPS3_POSITION               0x0000000B
#define _PWM1CON2_SEVOPS3_MASK                   0x00000800
#define _PWM1CON2_SEVOPS3_LENGTH                 0x00000001

#define _PWMCON2_UDIS_POSITION                   0x00000000
#define _PWMCON2_UDIS_MASK                       0x00000001
#define _PWMCON2_UDIS_LENGTH                     0x00000001

#define _PWMCON2_OSYNC_POSITION                  0x00000001
#define _PWMCON2_OSYNC_MASK                      0x00000002
#define _PWMCON2_OSYNC_LENGTH                    0x00000001

#define _PWMCON2_IUE_POSITION                    0x00000002
#define _PWMCON2_IUE_MASK                        0x00000004
#define _PWMCON2_IUE_LENGTH                      0x00000001

#define _PWMCON2_SEVOPS_POSITION                 0x00000008
#define _PWMCON2_SEVOPS_MASK                     0x00000F00
#define _PWMCON2_SEVOPS_LENGTH                   0x00000004

#define _PWMCON2_SEVOPS0_POSITION                0x00000008
#define _PWMCON2_SEVOPS0_MASK                    0x00000100
#define _PWMCON2_SEVOPS0_LENGTH                  0x00000001

#define _PWMCON2_SEVOPS1_POSITION                0x00000009
#define _PWMCON2_SEVOPS1_MASK                    0x00000200
#define _PWMCON2_SEVOPS1_LENGTH                  0x00000001

#define _PWMCON2_SEVOPS2_POSITION                0x0000000A
#define _PWMCON2_SEVOPS2_MASK                    0x00000400
#define _PWMCON2_SEVOPS2_LENGTH                  0x00000001

